[
  {
    "FirstName": "Amy",
    "LastName": "Bottoms",
    "Position": "Partner, Biopharmaceuticals and Life Sciences",
    "Bio": "Amy Bottoms is a Partner with Chartwell’s Biopharmaceuticals and Life Sciences Practice. She brings more than 25 years of experience working with life sciences companies to build impactful boards and leadership teams for the ultimate benefit of patients. She is known for her collaborative approach and leverages her expertise and relationships to uncover leaders who can solve business challenges.\n\nPrior to Chartwell, Amy spent seven years at a biopharma focused search firm. As Partner, she advised innovative therapeutics companies around recruitment strategies for key executive leadership and board roles. She also spent 17 years at Heidrick & Struggles as a member of their Life Sciences and Board of Directors practices and recruited senior leaders across the life sciences ecosystem including healthcare services, biopharma, life sciences tools and diagnostics companies.\n\nAmy received a B.A. in English Literature and a Master of Library Science from the University of Washington. She is a member of Women in Bio. Amy lives in the Seattle area with her husband and three kids and enjoys spending time hiking and traveling.",
    "PictureUrl": "images/team/amy-bottoms.png",
    "PhoneNumber": "360-710-1491",
    "LinkedInUrl": "/amy-bottoms",
    "DisplayOrder": 1,
    "Education": "B.A. in English Literature, Master of Library Science - University of Washington",
    "Certifications": "Member of Women in Bio",
    "Experience": "25+ years in life sciences, Partner at biopharma search firm, 17 years at Heidrick & Struggles",
    "OfficeLocation": "Seattle",
    "DepartmentServiceId": 1,
    "TeamRoleTitleId": 1,
    "CompanyServiceId": 1,
    "OurFirmId": 1

  },

  {
    "FirstName": "Sara",
    "LastName": "Hagar",
    "Position": "PARTNER, Biopharmaceuticals",
    "Bio": "Sara Hagar is a Partner and started up Chartwell’s Biopharmaceuticals Practice in 2019. Since 1991, she has specialized in life sciences executive search, recruiting Board members and executive officers across all functions for highly innovative startups to established companies.\n\nBefore Chartwell, Sara was a Partner with a boutique, healthcare-focused search firm, which she joined at its inception in 2008. Earlier in her career, she was a member of the Healthcare Sector at Russell Reynolds Associates, specializing in senior-level recruitment for biopharmaceutical and medical technology companies. Sara joined that firm in San Francisco in 1993 and relocated to Philadelphia in 1996.\n\nShe received her bachelor’s degree in Psychology from Bucknell University.\n\nSara was introduced at an early age to the pharmaceutical industry by her father who finished his career as CEO for one of the industry’s early neuronal cell therapy companies. She and her husband live in the Philadelphia area and enjoy spending time with family and friends.",
    "PictureUrl": "images/team/sarah-hagar.png",
    "PhoneNumber": "610-407-4663",
    "LinkedInUrl": "/sarahagar",
    "DisplayOrder": 2,
    "Education": "Bachelor’s degree in Psychology from Bucknell University",
    "Certifications": null,
    "Experience": "Over 30 years in life sciences executive search, Partner at Chartwell since 2019, previously at boutique healthcare search firm and Russell Reynolds Associates",
    "OfficeLocation": "Philadelphia",
    "DepartmentServiceId": 1,
    "TeamRoleTitleId": 1,
    "CompanyServiceId": 1,
    "OurFirmId": 1
  },

  {
    "FirstName": "Sean",
    "LastName": "O’Neal",
    "Position": "PARTNER, FINANCIAL SERVICES/REAL ESTATE",
    "Bio": "Sean O’Neal is a Partner with Chartwell Partners based in the firm’s Dallas office. Sean has 15 years of experience in Executive Search, following his career foundation and education in Finance.\n\nSean is a member of Chartwell’s Financial Services practice focused on senior-level assignments including Board, CEO, and cross-functional Senior Leadership Teams across banking, real estate, and the broader financial services ecosystem. His clients have ranged from Fortune 500 to entrepreneurial start-ups in publicly-traded, private equity owned, and privately held firms across North America as well as international assignments.\n\nPrior to Chartwell Partners, Sean spent six years with Heidrick & Struggles in progressive roles across multiple industry and functional verticals. Prior to his work in executive search, Sean worked in public accounting. He graduated from the University of Mississippi (Ole Miss) with both Bachelor’s and Master’s degrees in Accounting.",
    "PictureUrl": "images/team/sean-oneal.png",
    "PhoneNumber": "214-205-8735",
    "LinkedInUrl": "/sconeal",
    "DisplayOrder": 3,
    "Education": "Bachelor’s and Master’s degrees in Accounting from the University of Mississippi (Ole Miss).",
    "Certifications": null,
    "Experience": "15 years of experience in Executive Search, background in public accounting.",
    "OfficeLocation": "Dallas",
    "DepartmentServiceId": 1,
    "TeamRoleTitleId": 1,
    "CompanyServiceId": 1,
    "OurFirmId": 1
  },

  {
    "FirstName": "J. Scott",
    "LastName": "Petty",
    "Position": "MANAGING PARTNER, FINANCIAL SERVICES/REAL ESTATE",
    "Bio": "J. Scott Petty is a Partner in the Dallas office of Chartwell Partners and leads the firm’s Financial Services Practice serving bank, mortgage, wealth management and real estate clients across the country. Scott has established a successful track record as an executive search consultant recruiting senior executives and board directors for small- and mid-cap public and closely-held private companies.\n\nPrior to joining Chartwell in 2009, Scott spent over a decade between his tenures with Heidrick & Struggles and Spencer Stuart. Over the course of his time with each firm, he led search practices in banking, real estate and broad financial services.\n\nScott frequently presents on board and executive leadership topics through various association forums. In addition, Scott has published talent related articles over the years and has been quoted in Bank Director, Bloomberg News, American Banker, The Wall Street Journal and Builder Online.\n\nScott is a graduate of The University of Texas at Austin with a bachelor’s degree in psychology and minor in business management. He serves on the advisory board for the University of Texas McCombs MSF Council, is a board member for Friends of Sky Ranch and is a long-time advisory director for the West Dallas Community School.\n\nOutside of work, Scott enjoys spending time with his wife and family, fixing up old Toyota FJ40 Land Cruisers, shooting sports, outdoor adventures, and volunteering with Boy Scouts of America.",
    "PictureUrl": "1images/team/j-scott-petty.png",
    "PhoneNumber": "214-228-0343",
    "LinkedInUrl": "/jscottpetty",
    "DisplayOrder": 4,
    "Education": "Bachelor’s degree in psychology and minor in business management from The University of Texas at Austin.",
    "Certifications": null,
    "Experience": "Over a decade in executive search; led practices in banking, real estate, and financial services.",
    "OfficeLocation": "Dallas",
    "DepartmentServiceId": 1,
    "TeamRoleTitleId": 2,
    "CompanyServiceId": 1,
    "OurFirmId": 1
  },

  {
    "FirstName": "Ellen",
    "LastName": "Travers",
    "Position": "PARTNER, BIOPHARMACEUTICALS and CONSUMER HEALTHCARE",
    "Bio": "Ellen Travers is a national leader in executive search services focused on Board and C-level assignments in our biopharmaceutical and consumer healthcare practices. In her most recent role as the leader of the Talent Acquisition team for Xontogeny, a life science accelerator, Ellen managed executive, C-Suite, and Board recruitment needs for the portfolio companies of the accelerator and Perceptive Advisors’ PXV Fund. Ellen has dedicated her career to life science and biotech recruitment, offering clients an expertise and depth of knowledge that is unparalleled.\n\nEllen served as Senior Vice President at a boutique healthcare search firm where she spearheaded the strategic development and recruitment of senior-level executives in a global biotech and pharma arena. She also leverages her prior in-house talent acquisition experience from her leadership roles at Celgene, The Medicines Company, Sanofi (formerly Aventis) and McKinsey & Company.\n\nEllen earned her BA from Catholic University and master’s degree from Columbia University and serves as an active mentor for Women in Bio. Believing in the gift of giving back to the community, Ellen honors her parents’ legacy through her yoga teaching to inmates and as an ESL teacher to immigrants in her local community.",
    "PictureUrl": "images/team/ellen-travers.png",
    "PhoneNumber": "908-358-8094",
    "LinkedInUrl": "/ellen-travers-1950183",
    "DisplayOrder": 5,
    "Education": "BA from Catholic University, Master’s degree from Columbia University",
    "Certifications": null,
    "Experience": "Executive search, C-Suite, Talent Acquisition at Celgene, Sanofi, McKinsey",
    "OfficeLocation": "Not specified",
    "DepartmentServiceId": 1,
    "TeamRoleTitleId": 1,
    "CompanyServiceId": 1,
    "OurFirmId": 1
  },

  {
    "FirstName": "Julie",
    "LastName": "Bell",
    "Position": "LEADERSHIP ADVISORY",
    "Bio": "Dr. Julie Bell joined Chartwell Partners to lead the firm’s suite of Leadership Advisory services which includes Success Planning, Executive Assessments, Board Advisory, Executive Coaching and Keynote Speaking. She brings a 25-year track record of partnering with organizations and individuals in their quest to maximize performance.\n\nDr. Julie is a leader in the People IntelligenceTM industry with her development of CP Power 4 Assessment, Relationship Based Coaching and Technology Assisted Coaching.\n\nJulie earned her Bachelor of Science in Psychology from Oklahoma State University and a Master and Doctorate of Sport Psychology from the University of Virginia, where she studied under Dr. Bob Rotella. She has served as adjunct faculty at Oklahoma State University and Southern Methodist University. Her book, Performance Intelligence at Work, was published in 2009 by McGraw-Hill.\n\nShe lives on the lake in Athens, TX with her husband, Nelson, and 3 children when they are home from college.",
    "PictureUrl": "images/team/julie_bell.png",
    "PhoneNumber": "214-704-1099",
    "LinkedInUrl": null,
    "DisplayOrder": 6,
    "Education": "B.Sc. Psychology - Oklahoma State University, M.A. & PhD Sport Psychology - University of Virginia",
    "Certifications": "Adjunct Faculty, Published Author",
    "Experience": "25+ years in Leadership Advisory & Executive Coaching",
    "OfficeLocation": "Athens, TX",
    "DepartmentServiceId": 1,
    "TeamRoleTitleId": null,
    "CompanyServiceId": 3,
    "OurFirmId": 1
  },

  {
    "FirstName": "McCall",
    "LastName": "Adams",
    "Position": "SENIOR ASSOCIATE, FINANCIAL SERVICES / REAL ESTATE",
    "Bio": "McCall Adams joined the Chartwell Partners Financial Services and Real Estate Practice in 2022. McCall brings 10 years of experience in the banking industry and executive search to her role as a Senior Associate with Chartwell. Based in Austin, McCall focuses on senior level search assignments in banking and the broader financial services industry as well as real estate assignments nationally. McCall brings a high-touch approach to working with candidates and cares deeply about matching a client’s priorities and culture with the right candidates, ensuring a best-in-class experience and outcome for both parties.\n\nPrior to Chartwell, McCall spent time in a boutique executive search firm serving investor-backed technology companies following progressive roles at Texas Capital Bank and BBVA Compass partnering with bank leaders as a Senior Talent Acquisition Partner. McCall is a graduate of BBVA Compass’ formal bank training program.\n\nMcCall is an Austin native and a Longhorn. When she is not recruiting, she loves to spend time enjoying the city’s natural beauty with her husband, Michael, and their 2 children.",
    "PictureUrl": "images/team/McCall-Adams.png",
    "PhoneNumber": "512-565-0994",
    "LinkedInUrl": "/mccall-cunningham-adams",
    "DisplayOrder": 7,
    "Education": "Graduate of BBVA Compass’ formal bank training program",
    "Certifications": null,
    "Experience": "10 years in banking industry and executive search",
    "OfficeLocation": "Austin, TX",
    "DepartmentServiceId": 2,
    "TeamRoleTitleId": 4,
    "CompanyServiceId": null,
    "OurFirmId": 1
  },

  {
    "FirstName": "Byers",
    "LastName": "Hellinghausen",
    "Position": "Client Success Consultant, ASSOCIATE, FINANCIAL SERVICES/REAL ESTATE",
    "Bio": "Byers Hellinghausen is a Client Success Consultant for Chartwell Partner’s Executive Search and Leadership Advisory practices. With a solution-oriented mindset, Byers focuses on understanding client needs, crafting tailored strategies, and implementing effective solutions to help clients leverage Chartwell’s full suite of talent advisory services.\n\nHer prior experience at Chartwell Partners an experienced Associate executing executive-level assignments equipped Byers the insights and expertise necessary to navigate client challenges and drive impactful outcomes. Prior to joining Chartwell, Byers held progressive roles in Korn Ferry’s Technology and Financial Officer’s practices, supporting national and international assignments for Fortune 1000 clients.\n\nByers earned her bachelor’s in business administration from Texas A&M University. She resides in Dallas with her husband, Matt, and yellow Labrador retriever, Jill.",
    "PictureUrl": "images/team/Byers-Hellinghausen.png",
    "PhoneNumber": null,
    "LinkedInUrl": "/byers-hellinghausen-20327089",
    "DisplayOrder": 8,
    "Education": "Bachelor’s in Business Administration from Texas A&M University",
    "Certifications": null,
    "Experience": "Experienced Associate, Korn Ferry Technology & Financial Officer practices",
    "OfficeLocation": "Dallas, TX",
    "DepartmentServiceId": 2,
    "TeamRoleTitleId": 3,
    "CompanyServiceId": null,
    "OurFirmId": 1
  },

  {
    "FirstName": "Lindsey",
    "LastName": "Hoesterey",
    "Position": "Head of Research, Financial Services Practice",
    "Bio": "Lindsey Hoesterey is the Head of Research, Financial Services Practice. Prior to Chartwell Partners, Lindsey was the Head of Research at Morgan Samuels where she led a team supporting the firm’s client engagements across all practices.\n\nLindsey’s career began at Xerox where she was first an Entitlement Coordinator and then a Business Process Configuration Lead. Later, her skills took her to Grant Thornton in the Risk and Regulatory Department, where she was a Corporate Research Analyst and to James Drury Partners, where she was an Information Specialist.\n\nLindsey is based in Rochester, NY. She graduated from Dominican University with a Master’s degree in Library and Information Science and holds a Bachelor’s degree in Art and English.",
    "PictureUrl": "images/team/Lindsey-Hoesterey.png",
    "PhoneNumber": null,
    "LinkedInUrl": "/lindsey-hoesterey-79635216",
    "DisplayOrder": 9,
    "Education": "Master’s in Library and Information Science, Dominican University; Bachelor’s in Art and English",
    "Certifications": null,
    "Experience": "Head of Research at Morgan Samuels; Xerox; Grant Thornton; James Drury Partners",
    "OfficeLocation": "Rochester, NY",
    "DepartmentServiceId": 2,
    "TeamRoleTitleId": 5,
    "CompanyServiceId": null,
    "OurFirmId": 1
  },

  {
    "FirstName": "Jackson",
    "LastName": "Beall",
    "Position": "Research Associate",
    "Bio": "Jackson Beall is a Research Associate at Chartwell Partners, where he supports the firm’s Executive Search and Leadership Advisory practices by delivering tailored insights to meet organizational and client needs. Prior to joining full-time, Jackson honed his expertise during a year-and-a-half internship with Chartwell, gaining hands-on experience in executive recruiting, research, and candidate evaluation.\n\nWith dual degrees in Psychology and Business Management from the University of Oklahoma, Jackson combines academic rigor with practical experience to offer a well-rounded approach to leadership development and talent acquisition. His ability to align research with client objectives ensures impactful outcomes across a variety of industries.\n\nBased in Dallas, Jackson enjoys cheering on Sooner football, exploring nature through hiking, and spending time hunting with friends.",
    "PictureUrl": "images/team/Jackson-Beall.png",
    "PhoneNumber": null,
    "LinkedInUrl": "/jackson-beall-a6393b1b6",
    "DisplayOrder": 10,
    "Education": "B.S. in Psychology and Business Management, University of Oklahoma",
    "Certifications": null,
    "Experience": "Executive recruiting internship, Chartwell Partners",
    "OfficeLocation": "Dallas, TX",
    "DepartmentServiceId": 2,
    "TeamRoleTitleId": 6,
    "CompanyServiceId": null,
    "OurFirmId": 1
  },

  {
    "FirstName": "Amy",
    "LastName": "Maloney",
    "Position": "SENIOR ASSOCIATE, FINANCIAL SERVICES/REAL ESTATE",
    "Bio": "Amy Maloney is a Senior Associate with Chartwell Partners and supports client engagements primarily in the areas of financial services, real estate and financial officers. She joined the executive search industry in 2000. Prior to joining Chartwell, she was a Research Assistant, then Associate in the Dallas office of Spencer Stuart.\n\nAmy’s search experience spans multiple industries and functions. At Spencer Stuart, she primarily focused on technology, life sciences & not-for-profit, and the firm’s CIO practice. Since 2009, she has spent the majority of her time working in the financial services, real estate and financial officers practices.\n\nPrior to executive recruiting, Amy began her career in public relations, working in the Dallas office of Publicis Dialog.\n\nAmy holds a Bachelor’s degree in Communications from The University of Texas at Austin and resides in Beaumont, TX with her family. She serves on the Buckner Auxiliary Board and enjoys raveling and spending time with family and friends.",
    "PictureUrl": "images/team/Amy-Maloney.png",
    "PhoneNumber": "214-269-3087",
    "LinkedInUrl": "/amy-maloney-42282bb",
    "DisplayOrder": 11,
    "Education": "B.A. in Communications, The University of Texas at Austin",
    "Certifications": null,
    "Experience": "Executive Search since 2000; Spencer Stuart; Publicis Dialog",
    "OfficeLocation": "Beaumont, TX",
    "DepartmentServiceId": 2,
    "TeamRoleTitleId": 4,
    "CompanyServiceId": null,
    "OurFirmId": 1
  },

  {
    "FirstName": "Suzanne",
    "LastName": "Watson",
    "Position": "SENIOR ASSOCIATE, BIOPHARMACEUTICALS",
    "Bio": "Suzanne Watson is a Senior Associate with Chartwell Partners and has worked in the executive search industry since 1996. Suzanne’s experience spans multiple industries, including technology, financial services, higher education, healthcare, and professional services. For the past sixteen years with Chartwell Partners, her focus has been across multiple functional areas within the healthcare space, specifically, healthcare services, managed care, healthcare IT, and biopharmaceuticals.\n\nBefore joining Chartwell Partners in 2005 as a Senior Associate, she spent nearly three years as a Senior Associate in the Austin and Dallas offices of Heidrick & Struggles. While at Heidrick & Struggles, her focus areas include insurance, healthcare, financial services, and technology. Her first six years in the industry were spent progressing through various roles as Researcher, Research Director, and Search Associate for Schuyler, Frye & Baker, and Emerging Search, both boutique firms in Atlanta, Georgia.\n\nSuzanne and her husband, Matt, live in Cumming, Georgia, a town 30 miles north of Atlanta. She enjoys running, horseback riding, hiking and spending time with her family.",
    "PictureUrl": "images/team/Suzanne-Watson.png",
    "PhoneNumber": "678-231-6176",
    "LinkedInUrl": "/suzanne-watson-009aa62",
    "DisplayOrder": 12,
    "Education": null,
    "Certifications": null,
    "Experience": "Executive Search since 1996; Chartwell Partners; Heidrick & Struggles; Schuyler, Frye & Baker; Emerging Search",
    "OfficeLocation": "Cumming, Georgia",
    "DepartmentServiceId": 2,
    "TeamRoleTitleId": 4,
    "CompanyServiceId": null,
    "OurFirmId": 1
  },

  {
    "FirstName": "Martha",
    "LastName": "Campbell",
    "Position": "Administrative",
    "PictureUrl": "images/team/Martha-Campbell.png",
    "DisplayOrder": 13,
    "DepartmentServiceId": 3,
    "TeamRoleTitleId": 8,
    "OurFirmId": 1

  },

  {
    "FirstName": "Hanna",
    "LastName": "Im-Lee",
    "Position": "Administrative",
    "PictureUrl": "images/team/Hanna-Im-Lee.jpg",
    "DisplayOrder": 14,
    "DepartmentServiceId": 3,
    "TeamRoleTitleId": 8,
    "OurFirmId": 1

  }

]